ПринятьМарку = ИСТИНА;
исходящийJSON = СформироватьJSONПринятияИлиОтказаМарки(ПринятьМарку, УровеньОтладки);
ответJSON = "";
описаниеОшибки = ""; КодОшибки = 0;
резКомандыПринятьМарку = ВыполнитьЗаданиеJSON(всеПараметрыЧека.COMДрайверККТ10, всеПараметрыЧека.НастройкаиСвязиСКТТ, исходящийJSON, 
									   ответJSON, описаниеОшибки, КодОшибки,
									?(НеЗакрыватьСоединениеСККТ, ЛОЖЬ, ИСТИНА), НеЗакрыватьСоединениеСККТ);
если не резКомандыПринятьМарку тогда
	стрРезПроверкиМарок.Вставить("JSONЗапрос", исходящийJSON);
	стрРезПроверкиМарок.Вставить("ответJSON", ответJSON);													 	
	
	стрРезПроверкиМарок.Вставить("описаниеОшибки", описаниеОшибки);
	стрРезПроверкиМарок.Вставить("КодОшибки", КодОшибки);			
	ВыполнитьОбработкуОповещения(ОповещениеПослеПроверкиМарок, стрРезПроверкиМарок);
	Возврат;
конецЕсли;          			


функция СформироватьJSONПринятияИлиОтказаМарки(Приянть = ИСТИНА, уровеньОтладки = 1, ОтменаПроверкиМарки = ЛОЖЬ) экспорт
	Если уровеньОтладки >= 3 тогда
		Сообщить("начало: СформироватьJSONПринятияИлиОтказаМарки");	
	конецЕсли;		
	
	acceptOrRejectMark = "acceptMarkingCode";
	если НЕ Приянть тогда
		acceptOrRejectMark = "declineMarkingCode";
	конецЕсли;
	Если ОтменаПроверкиМарки тогда
		 acceptOrRejectMark = "cancelMarkingCodeValidation";
	конецЕсли;
	
	json = Новый ЗаписьJSON;                   
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	json.УстановитьСтроку(ПараметрыЗаписиJSON);
	json.ЗаписатьНачалоОбъекта();	
	json.ЗаписатьИмяСвойства("type");
	json.ЗаписатьЗначение(acceptOrRejectMark);	
	json.ЗаписатьКонецОбъекта();
	Если уровеньОтладки >= 3 тогда
		Сообщить("конец: СформироватьJSONПринятияИлиОтказаМарки");	
	конецЕсли;			
	возврат json.Закрыть();		
конецФункции //СформироватьJSONПолученияСтатусаПроверкиМаврки
