функция ПолучитьПолноеИмяФайлаНастроек()
	текКаталогДляНастроек = КаталогВременныхФайлов();
	текКаталогДляНастроек = СтрЗаменить(текКаталогДляНастроек, "Local\Temp\", "");
	текКаталогДляНастроек = текКаталогДляНастроек + "Roaming\";
	КаталогНаДиске = Новый Файл(текКаталогДляНастроек);
	Если НЕ КаталогНаДиске.Существует() тогда        
		СоздатьКаталог(текКаталогДляНастроек);
	конецЕсли;	                                    
	текКаталогДляНастроек = текКаталогДляНастроек + "ATOL\";
	КаталогНаДиске = Новый Файл(текКаталогДляНастроек);
	Если НЕ КаталогНаДиске.Существует() тогда        
		СоздатьКаталог(текКаталогДляНастроек);
	конецЕсли;		                                  
	текКаталогДляНастроек = текКаталогДляНастроек + "drivers10\";
	КаталогНаДиске = Новый Файл(текКаталогДляНастроек);
	Если НЕ КаталогНаДиске.Существует() тогда        
		СоздатьКаталог(текКаталогДляНастроек);
	конецЕсли;		                                  
	текКаталогДляНастроек = текКаталогДляНастроек + "options\";             
	директорияЛогФайловАтол = СокрЛП(текКаталогДляНастроек);
	КаталогНаДиске = Новый Файл(текКаталогДляНастроек);
	Если НЕ КаталогНаДиске.Существует() тогда        
		СоздатьКаталог(текКаталогДляНастроек);
	конецЕсли;		   
	имяФайлаНастроек = "options.ini";
	Возврат текКаталогДляНастроек+имяФайлаНастроек;	
конецФункции //ПолучитьПолноеИмяФайлаНастроек

функция ПреобразоватьИзСтрокиВЗначениеНастройки(Тип, ключ, значениеСтрока)
	рез = СокрЛП(значениеСтрока);
	Если Тип = Тип("Число") тогда
		рез = Число(значениеСтрока);
	иначеЕсли Тип = Тип("Булево") тогда
		рез = ИСТИНА;
		Если значениеСтрока = "false" тогда
			рез = ЛОЖЬ;
		конецЕсли;
	конецЕсли;
	Возврат рез;
конецФункции //ПреобразоватьИзСтрокиВЗначениеНастройки

Функция ПолучитьЗначениеНастройки(структураНастройкаиСвязиСКТТ, Наимен) экспорт
	рез = Неопределено;
	СтруктутурОднойНастройки = "";
	Если структураНастройкаиСвязиСКТТ.Свойство(Наимен, СтруктутурОднойНастройки) тогда
		Если СтруктутурОднойНастройки.Свойство("Значение") тогда
			рез = СтруктутурОднойНастройки.Значение;
		иначе
			рез = СтруктутурОднойНастройки.ЗначПоУмолч;
		конецЕсли;
	конецЕсли;
	Возврат рез;
КонецФункции //ПолучитьЗначениеНастройки

функция СоздатьИзначальнуюСтруктутурОднойНастройки(Наимен, Тип, ЗначПоУмолч = "", Описание = "", СписокВозможныхЗначений = НЕОПРЕДЕЛЕНО, НаимВИнетерфейсе = "")
	струк = Новый Структура;
	струк.Вставить("Наимен", Наимен);
	струк.Вставить("Тип", Тип);
	струк.Вставить("ЗначПоУмолч", ЗначПоУмолч);
	струк.Вставить("СписокЗначений", СписокВозможныхЗначений);
	струк.Вставить("Описание", Описание);
	струк.Вставить("НаимВИнетерфейсе", НаимВИнетерфейсе);
	//струк.Вставить("Значение", "");
	возврат струк;
конецФункции //СоздатьИзначальнуюСтруктутурОднойНастройки

функция ДобавитьНастройку(структураНастройкаиСвязиСКТТ, Наимен, Тип, ЗначПоУмолч = НЕОПРЕДЕЛЕНО, Описание = "", СписокВозможныхЗначений = НЕОПРЕДЕЛЕНО, НаимВИнетерфейсе = "")
	структураНастройкаиСвязиСКТТ.Вставить(Наимен, СоздатьИзначальнуюСтруктутурОднойНастройки(Наимен, Тип, ЗначПоУмолч, Описание, СписокВозможныхЗначений, НаимВИнетерфейсе));
конецФункции //ДобавитьНастройку


функция НастройкиККТСформироватьСтруктуруИзначальную() экспорт
	структураНастройкаиСвязиСКТТ = Новый Структура;
	СписокВозможныхЗначений = Новый СписокЗначений;
	СписокВозможныхЗначений.Добавить("через COM/USB");
	СписокВозможныхЗначений.Добавить("по IP ккт");
	СписокВозможныхЗначений.Добавить("через сервер ККТ");
	СписокВозможныхЗначений.Добавить("web сервер");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ТипСвязи", Тип("Строка"), "через сервер ККТ", "тип связи с ККТ", СписокВозможныхЗначений);
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "IP", Тип("Строка"), "", "IP");
	//ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "IP_ККТ", "", "IP");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "Порт_IPККТ", Тип("Число"), 0, "порт IP ККТ");
	//ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "IP_СерверККТ", "", "порт IP ККТ");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "Таймаут_севрерККТ", Тип("Число"), 1000, "Таймаут ожидания ответа от севрера ККТ");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "НомерCOM", Тип("Число"), 0, "Номер COM порта");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "УровеньОтладки", Тип("Число"), 0, "Уровень логирования и отладки (0 - самый низкий)");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ИмяКассира", Тип("Строка"), "", "имяКассира");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ФлТестовыйРежим", Тип("Булево"), FALSE, "Тестовый режим (без пробития чеков на ККТ)");
	//структураНастройкаиСвязиСКТТ.Вставить("COMConnect", false);
	//Если исхСтруктура.номерCOM = 0 тогда
	//	структураНастройкаиСвязиСКТТ.Вставить("COMConnect", true);
	//конецЕсли; 
	//ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "IDWebККТ", Тип("Строка"), "", "ID web ККТ (");
	//структураНастройкаиСвязиСКТТ.Вставить("IDWebККТ", исхСтруктура.IDWebККТ);
	//структураНастройкаиСвязиСКТТ.Вставить("ПользовательWEB", исхСтруктура.ПользовательWEB);
	//структураНастройкаиСвязиСКТТ.Вставить("ПWEB", исхСтруктура.ПWEB);
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ЭмулироватьЗадержкуОтветаОтИСМ", Тип("Булево"), FALSE, "Иммитация задержки получения ответа от четного знака");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ИмитацияНеПолученияОтветаОтЧестногоЗнака", Тип("Булево"), FALSE, "Иммитация ошибки получения ответа от честного знака");
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "МаксимальноеКолПопытокПроверкиМарки", Тип("Число"), 4, "Максимальное количество попыток проверки марки");	
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "неЗакрыватьСоедиениеВОднойТранзакцииПечатиЧека", Тип("Булево"), ИСТИНА, "не отсоединяться от ККТ в одной транзакции");	
	
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ПоказыватьПечатнуюФормуЧекаПослеПечатиНаККТ", Тип("Булево"), ЛОЖЬ, "Показывать печатную форму чека после печати чека на ККТ");	
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ПоказыватьПечатнуюФормуЧекаПередПробитиемНаККТ", Тип("Булево"), ЛОЖЬ, "Показывать печатную форму перед пробитием чека на ККТ");	
	//разрешительный режим
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ВключитьРазрешительныйРежим", Тип("Булево"), ЛОЖЬ, "Включить разрешительный режим");	
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "IPСервисаРР", Тип("Строка"), "localhost", "IP адрес сервиса разрешительного режима");	
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ПортСервисаРР", Тип("Число"), 2578, "Номер порта для сервиса разрешительного режима");	
	//по старому всё делать
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ПробиватьПоСтарому", Тип("Булево"), ИСТИНА, "Пробивать чек по старому алгоритму");	
	//показывать кнопки тестирования                                                                                                    
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ПоказыватьКнопкиТестирования", Тип("Булево"), ЛОЖЬ, "Показывать кнопки для тестирования");	
	//часовая зона для ККТ
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ЧасоваяЗона", Тип("Число"), 6, "Часовая зона ККТ");	
	//использовать внешнюю программы для проверки марок	
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ИспользоватьВнешнююПрограммуДляПроверокМарок", Тип("Булево"), ИСТИНА, "Использовать внешнюю программу для проверки марок");
	//путь к файлу внешней программы проверки марок
	ДобавитьНастройку(структураНастройкаиСвязиСКТТ, "ПутьКФайлуВнешнейПрограммыПроверкиМарок", Тип("Строка"), "C:\Users\Enduro\Documents\fl\lancer\атол1сСамоп202502\new20251009\delphi\Win32\Debug\check_marks_pr.exe", "путь к файлу внешней программы проверки марок");
	Возврат структураНастройкаиСвязиСКТТ;
конецФункции //НастройкиККТСформироватьСтруктуруИзначальную




Функция ПрочитатьНастройкиККТ() экспорт
	полноеИмяФайлаНакстроек = ПолучитьПолноеИмяФайлаНастроек();
	структураНастройкаиСвязиСКТТ = НастройкиККТСформироватьСтруктуруИзначальную();
	файлНастроекПроверкаСущестования = Новый Файл(полноеИмяФайлаНакстроек);		
	файлНастроекСуществует = файлНастроекПроверкаСущестования.Существует();
	Если Не файлНастроекСуществует тогда
		Возврат структураНастройкаиСвязиСКТТ;
	конецЕсли;
	тестДокумНастр = Новый ТекстовыйДокумент;
	тестДокумНастр.Прочитать(полноеИмяФайлаНакстроек);
	всегоСтрокНастроек = тестДокумНастр.КоличествоСтрок();
	для номСтр = 1 по всегоСтрокНастроек цикл
		стрНастройки = тестДокумНастр.ПолучитьСтроку(номСтр);
		Если СокрЛП(стрНастройки) = "" тогда
			Продолжить;
		конецЕсли;
		ключ = ""; значениеСтрока = ""; свойстваНастройки = "";
		ПолучитьКлючИЗначениеИзСтроки(стрНастройки, ключ, значениеСтрока);
		СтруктутурОднойНастройки = "";
		структураНастройкаиСвязиСКТТ.Свойство(ключ, СтруктутурОднойНастройки);
		Если СтруктутурОднойНастройки <> НЕОПРЕДЕЛЕНО тогда 
			значение = ПреобразоватьИзСтрокиВЗначениеНастройки(СтруктутурОднойНастройки.Тип, ключ, значениеСтрока);
			Если структураНастройкаиСвязиСКТТ.Свойство(ключ, свойстваНастройки) тогда
				свойстваНастройки.Вставить("Значение", значение);
			конецЕсли;
		конецЕсли;
	конецЦикла;
	Возврат структураНастройкаиСвязиСКТТ;
конецФункции //ПрочитатьНастройкиККТ
