//строки печати чека
ответJSON = "";
описаниеОшибки = ""; КодОшибки = 0;
исходящийJSON = СформироватьJSONЧека(всеПараметрыЧека.списПараметровЧека, всеПараметрыЧека.массивЧека, УровеньОтладки);
стрРезПечатиЧека.Вставить("JSONЧека", исходящийJSON);
резПечатиЧека = ВыполнитьЗаданиеJSON(всеПараметрыЧека.COMДрайверККТ10, всеПараметрыЧека.НастройкаиСвязиСКТТ, исходящийJSON, 
			ответJSON, описаниеОшибки, КодОшибки, ?(НеЗакрыватьСоединениеСККТ, ЛОЖЬ, ИСТИНА), ЛОЖЬ);
стрРезПечатиЧека.Вставить("ответJSON", ответJSON);							   


функция ВыполнитьЗаданиеJSON(COMДрайверККТ10, НастройкаиСвязиСКТТ, JSONЗадание, ОтветJSON, описаниеОшибки = "", 
	КодОшибки = 0, ПодключатьсяКККТ = ИСТИНА, 
		НеЗакрыватьСоединениеСККТ = FALSE) экспорт
УровеньОтладки = ПолучитьЗначениеНастройки(НастройкаиСвязиСКТТ, "УровеньОтладки");
ФлТестовыйРежим = ПолучитьЗначениеНастройки(НастройкаиСвязиСКТТ, "ФлТестовыйРежим");
Time_Zone = ПолучитьЗначениеНастройки(НастройкаиСвязиСКТТ, "ЧасоваяЗона");

Если УровеньОтладки >= 3 тогда
Сообщить("начало: ВыполнитьЗаданиеJSON");	
Сообщить("JSONЗадание="+СокрЛП(JSONЗадание));
конецЕсли;			
рез = ИСТИНА;
ОтветJSON = "";
Если ПодключатьсяКККТ тогда
резПодкл = Подключиться(COMДрайверККТ10, НастройкаиСвязиСКТТ, описаниеОшибки, КодОшибки);
Если НЕ резПодкл тогда
стрОшибки = описаниеОшибки;
Если уровеньОтладки >=2 тогда
Сообщить(стрОшибки);
конецЕсли;
ЗалогироватьОпреацию(0, "Подключение ККТ в ВыполнитьЗаданиеJSON", УровеньОтладки, False, КодОшибки, стрОшибки);
рез = ЛОЖЬ;
Если уровеньОтладки >= 3 тогда
Сообщить("конец: ВыполнитьЗаданиеJSON");	
конецЕсли;					
Возврат рез;
конецЕсли;	
конецЕсли;

резПровКоманды = 0;
Если УровеньОтладки >= 3 тогда
COMДрайверККТ10.setParam(COMДрайверККТ10.LIBFPTR_PARAM_JSON_DATA, JSONЗадание);
резПровКоманды = COMДрайверККТ10.validateJson();
конецЕсли;  
Если резПровКоманды <> 0 тогда                                          
ЛокОписаниеОшибки = COMДрайверККТ10.errorDescription();
Если Найти(ЛокОписаниеОшибки, "validateTask") > 0 тогда
резПровКоманды = 0;
//флТестовыйРежим = ЛОЖЬ;
конецЕсли;
конецЕсли;
Если резПровКоманды <> 0 тогда
кодОшибки = COMДрайверККТ10.errorCode();
описаниеОшибки = COMДрайверККТ10.errorDescription();          		
Если УровеньОтладки >=2 тогда
Сообщить(описаниеОшибки);
конецЕсли;
ЗалогироватьОпреацию(0, "проверить корректность JSON в ВыполнитьЗаданиеJSON", УровеньОтладки, False, КодОшибки, описаниеОшибки);
рез = ЛОЖЬ;                                               
конецЕсли;		                                                  	

Если УровеньОтладки >=3 тогда
Сообщить("Выполнение json задания...");
конецЕсли;				

//COMДрайверККТ10.setSingleSetting(COMДрайверККТ10.LIBFPTR_SETTING_TIME_ZONE, COMДрайверККТ10.LIBFPTR_TIME_ZONE_6);
COMДрайверККТ10.setSingleSetting(COMДрайверККТ10.LIBFPTR_SETTING_TIME_ZONE, Time_Zone);
COMДрайверККТ10.applySingleSettings();

Если резПровКоманды = 0 тогда    
резВыпКоманды = 0;
Если Не ФлТестовыйРежим тогда
COMДрайверККТ10.setParam(COMДрайверККТ10.LIBFPTR_PARAM_JSON_DATA, JSONЗадание);
резВыпКоманды = COMДрайверККТ10.processJson();
конецЕсли;
Если резВыпКоманды <> 0 тогда
кодОшибки = COMДрайверККТ10.errorCode();
описаниеОшибки = COMДрайверККТ10.errorDescription();          		
Если УровеньОтладки >=2 тогда
Сообщить(описаниеОшибки);
конецЕсли;
ЗалогироватьОпреацию(0, "ВыполнитьЗаданиеJSON", УровеньОтладки, False, КодОшибки, описаниеОшибки);					
рез = ЛОЖЬ;                                               
иначе                        
Если Не ФлТестовыйРежим тогда
ОтветJSON = COMДрайверККТ10.getParamString(COMДрайверККТ10.LIBFPTR_PARAM_JSON_DATA);
иначе
ОтветJSON = ПолучитьМокОтветНаJSONКомманду(JSONЗадание);
конецЕсли;
конецЕсли;		                                                  
конецЕсли;

Если НЕ НеЗакрыватьСоединениеСККТ тогда
ОписаниеОшибкиОтключения = "";
КодОшибкиОтключения = 0;
резОтключ = Отключиться(COMДрайверККТ10, УровеньОтладки, ФлТестовыйРежим, ОписаниеОшибкиОтключения, КодОшибкиОтключения);
Если НЕ резОтключ тогда
стрОшибки = ОписаниеОшибкиОтключения;
Если УровеньОтладки >=2 тогда
Сообщить(стрОшибки);
конецЕсли;
ЗалогироватьОпреацию(0, "Отключение от ККТ в ВыполнитьЗаданиеJSON", УровеньОтладки, False, КодОшибкиОтключения, стрОшибки);
конецЕсли;        
конецЕсли;
Если УровеньОтладки >= 3 тогда
Сообщить("ОтветJSON="+СокрЛП(ОтветJSON));
Сообщить("конец: ВыполнитьЗаданиеJSON");	
конецЕсли;						
возврат рез;
конецФункции //ВыполнитьЗаданиеJSON
